#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum WKND.ENTHapticHands
enum class ENTHapticHands : uint8_t
{
	NTHapticHands_Left             = 0,
	NTHapticHands_Right            = 1,
	NTHapticHands_Both             = 2,
	NTHapticHands_MAX              = 3
};


// Enum WKND.ETriggeredInteractionResult
enum class ETriggeredInteractionResult : uint8_t
{
	InteractionAccepted            = 0,
	AlreadyInteracting             = 1,
	WrongInteractableType          = 2,
	InteractableNotEnabled         = 3,
	InteractableAlreadyUsed        = 4,
	InteractableInCooldown         = 5,
	InvalidInteraction             = 6,
	ETriggeredInteractionResult_MAX = 7
};


// Enum WKND.EDamageStrength
enum class EDamageStrength : uint8_t
{
	Cosmetic                       = 0,
	Weak                           = 1,
	Standard                       = 2,
	Critical                       = 3,
	Lethal                         = 4,
	EDamageStrength_MAX            = 5
};


// Enum WKND.EDamageType
enum class EDamageType : uint8_t
{
	Melee                          = 0,
	Ranged                         = 1,
	ForceChoke                     = 2,
	EDamageType_MAX                = 3
};


// Enum WKND.EComboEndType
enum class EComboEndType : uint8_t
{
	ECET_PoseStopped               = 0,
	ECET_ComboAborted              = 1,
	ECET_ComboSuccess              = 2,
	ECET_ComboFailed               = 3,
	ECET_MAX                       = 4
};


// Enum WKND.EComboAngleCheck
enum class EComboAngleCheck : uint8_t
{
	ECAC_Success                   = 0,
	ECAC_TooSimilar                = 1,
	ECAC_TooSimilarReverse         = 2,
	ECAC_TooStabLike               = 3,
	ECAC_FailedToResolve           = 4,
	ECAC_Undefined                 = 5,
	ECAC_MAX                       = 6
};


// Enum WKND.EContestedClashResult
enum class EContestedClashResult : uint8_t
{
	None                           = 0,
	Pushback                       = 1,
	FailedInitialBlock             = 2,
	Timeout                        = 3,
	Overpivot                      = 4,
	ClashReleased                  = 5,
	TargetLost                     = 6,
	HiltClash                      = 7,
	EContestedClashResult_MAX      = 8
};


// Enum WKND.EParryResult
enum class EParryResult : uint8_t
{
	Success                        = 0,
	Early                          = 1,
	Late                           = 2,
	Slow                           = 3,
	EParryResult_MAX               = 4
};


// Enum WKND.ECombat_ComboAttackResult
enum class ECombat_ComboAttackResult : uint8_t
{
	None                           = 0,
	ComboSuccess                   = 1,
	ComboBlocked                   = 2,
	ComboOverPowered               = 3,
	ComboParried                   = 4,
	ECombat_MAX                    = 5
};


// Enum WKND.ECombatStageType
enum class ECombatStageType : uint8_t
{
	Undefined                      = 0,
	Attack                         = 1,
	Block                          = 2,
	Defend                         = 3,
	Duel                           = 4,
	Evade                          = 5,
	Exposition                     = 6,
	Idle                           = 7,
	Move                           = 8,
	Parry                          = 9,
	Reaction                       = 10,
	Throw                          = 11,
	ECombatStageType_MAX           = 12
};


// Enum WKND.ETutorialDisplayType
enum class ETutorialDisplayType : uint8_t
{
	ETDT_FullOff                   = 0,
	ETDT_NoTutorial                = 1,
	ETDT_CurrentTutorial           = 2,
	ETDT_InAreaError               = 3,
	ETDT_MAX                       = 4
};


// Enum WKND.ENTSnapDirection
enum class ENTSnapDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	ENTSnapDirection_MAX           = 2
};


// Enum WKND.ETelemetryEventType
enum class ETelemetryEventType : uint8_t
{
	DamageTaken                    = 0,
	HealthLevelChange              = 1,
	Death                          = 2,
	WaveStarted                    = 3,
	WaveCompleted                  = 4,
	WaveFailed                     = 5,
	TimeLimitExceeded              = 6,
	ETelemetryEventType_MAX        = 7
};


// Enum WKND.ERating
enum class ERating : uint8_t
{
	NotYetRated                    = 0,
	NoMedal                        = 1,
	Bronze                         = 2,
	Silver                         = 3,
	Gold                           = 4,
	ERating_MAX                    = 5
};


// Enum WKND.EForceSocketState
enum class EForceSocketState : uint8_t
{
	Empty                          = 0,
	Capturing                      = 1,
	Occupied                       = 2,
	Releasing                      = 3,
	EForceSocketState_MAX          = 4
};


// Enum WKND.ECorvaxianBoxAnimationMode
enum class ECorvaxianBoxAnimationMode : uint8_t
{
	Off                            = 0,
	RandomPattern                  = 1,
	ExtendSinglePiston             = 2,
	RetractSinglePiston            = 3,
	ExtendAllPistons               = 4,
	RetractAllPistons              = 5,
	ECorvaxianBoxAnimationMode_MAX = 6
};


// Enum WKND.EAIStatusCheckType
enum class EAIStatusCheckType : uint8_t
{
	BranchOnError                  = 0,
	BranchOnSuccess                = 1,
	EAIStatusCheckType_MAX         = 2
};


// Enum WKND.EAIAlignComponent
enum class EAIAlignComponent : uint8_t
{
	AlignActorRoot                 = 0,
	AlignMeshComponent             = 1,
	EAIAlignComponent_MAX          = 2
};


// Enum WKND.EAIMovementOverride
enum class EAIMovementOverride : uint8_t
{
	AutoSelect                     = 0,
	TankTurns                      = 1,
	SwingTurn                      = 2,
	SlideTurn                      = 3,
	MoveNoTurn                     = 4,
	FlyTo                          = 5,
	AlignLinear                    = 6,
	AlignSmooth                    = 7,
	EAIMovementOverride_MAX        = 8
};


// Enum WKND.EAIPatrolCorners
enum class EAIPatrolCorners : uint8_t
{
	StopAndTurn                    = 0,
	Continious                     = 1,
	EAIPatrolCorners_MAX           = 2
};


// Enum WKND.EAIPatrolStart
enum class EAIPatrolStart : uint8_t
{
	UseEarliest                    = 0,
	UseClosest                     = 1,
	EAIPatrolStart_MAX             = 2
};


// Enum WKND.EAIPatrolEnd
enum class EAIPatrolEnd : uint8_t
{
	StopAfterPatrol                = 0,
	LoopAfterPatrol                = 1,
	PingPongPatrol                 = 2,
	EAIPatrolEnd_MAX               = 3
};


// Enum WKND.EAIThrowSelection
enum class EAIThrowSelection : uint8_t
{
	ShortThrow                     = 0,
	LongThrow                      = 1,
	DetermineThrowFromDistance     = 2,
	EAIThrowSelection_MAX          = 3
};


// Enum WKND.EIdleBehaviourSelectionPolicy
enum class EIdleBehaviourSelectionPolicy : uint8_t
{
	Random                         = 0,
	Sequential                     = 1,
	EIdleBehaviourSelectionPolicy_MAX = 2
};


// Enum WKND.EInteractableUsedPoint
enum class EInteractableUsedPoint : uint8_t
{
	AtInteractionStart             = 0,
	AtInteractionEnd               = 1,
	AtInteractionEndAlways         = 2,
	AtUsedInstruction              = 3,
	AtUsedInstructionAlways        = 4,
	EInteractableUsedPoint_MAX     = 5
};


// Enum WKND.EBuddyInteractableType
enum class EBuddyInteractableType : uint8_t
{
	PointOfInterest                = 0,
	PlayerTriggered                = 1,
	EBuddyInteractableType_MAX     = 2
};


// Enum WKND.EBuddyAIMovementType
enum class EBuddyAIMovementType : uint8_t
{
	NoneSelected                   = 0,
	Creep                          = 1,
	Walk                           = 2,
	Run                            = 3,
	Sprint                         = 4,
	EBuddyAIMovementType_MAX       = 5
};


// Enum WKND.ENPCNavigationSystemType
enum class ENPCNavigationSystemType : uint8_t
{
	Unreal                         = 0,
	NT_AI_Instruction              = 1,
	NT_Staged_Combat               = 2,
	Other                          = 3,
	ENPCNavigationSystemType_MAX   = 4
};


// Enum WKND.ENPCCombatType
enum class ENPCCombatType : uint8_t
{
	Melee                          = 0,
	Ranged                         = 1,
	Mixed                          = 2,
	ENPCCombatType_MAX             = 3
};


// Enum WKND.EConstructType
enum class EConstructType : uint8_t
{
	ConstructType_Both             = 0,
	ConstructType_Build            = 1,
	ConstructType_Unbuild          = 2,
	ConstructType_MAX              = 3
};


// Enum WKND.ECuttabilityType
enum class ECuttabilityType : uint8_t
{
	Uncuttable                     = 0,
	Cuttable                       = 1,
	TriviallyCuttable              = 2,
	ECuttabilityType_MAX           = 3
};


// Enum WKND.EForceItemState
enum class EForceItemState : uint8_t
{
	Inert                          = 0,
	Vibrating                      = 1,
	StartFloating                  = 2,
	Floating                       = 3,
	ForceGrab                      = 4,
	Held                           = 5,
	UnderSocketInfluence           = 6,
	EForceItemState_MAX            = 7
};


// Enum WKND.EForceSocketCaptureConstraint
enum class EForceSocketCaptureConstraint : uint8_t
{
	ExactRotation                  = 0,
	AllowRotationAroundY           = 1,
	AllowRotationAroundZ           = 2,
	EForceSocketCaptureConstraint_MAX = 3
};


// Enum WKND.EForceSocketType
enum class EForceSocketType : uint8_t
{
	None                           = 0,
	PhysicsConstraint              = 1,
	LockedUntilReleased            = 2,
	EForceSocketType_MAX           = 3
};


// Enum WKND.EInteractionMethodEnum
enum class EInteractionMethodEnum : uint8_t
{
	IME_LaserPointer               = 0,
	IME_Hand                       = 1,
	IME_MAX                        = 2
};


// Enum WKND.EGhostingMode
enum class EGhostingMode : uint8_t
{
	Instant                        = 0,
	DistanceBased                  = 1,
	TimeBased                      = 2,
	EGhostingMode_MAX              = 3
};


// Enum WKND.EGhostingReason
enum class EGhostingReason : uint8_t
{
	Overlap                        = 0,
	Force                          = 1,
	Environment                    = 2,
	EGhostingReason_MAX            = 3
};


// Enum WKND.EAllowedRotationDirection
enum class EAllowedRotationDirection : uint8_t
{
	Any                            = 0,
	IncreasingOnly                 = 1,
	DecreasingOnly                 = 2,
	EAllowedRotationDirection_MAX  = 3
};


// Enum WKND.EClimbPrimaryToken
enum class EClimbPrimaryToken : uint8_t
{
	ClimbPrimaryToken_This         = 0,
	ClimbPrimaryToken_Other        = 1,
	ClimbPrimaryToken_None         = 2,
	ClimbPrimaryToken_MAX          = 3
};


// Enum WKND.EClimbState
enum class EClimbState : uint8_t
{
	ClimbState_Released            = 0,
	ClimbState_IsClimbingDelimeter = 1,
	ClimbState_Climbing            = 2,
	ClimbState_ShockWax            = 3,
	ClimbState_ShockWane           = 4,
	ClimbState_MAX                 = 5
};


// Enum WKND.EVRCameraTransitionType
enum class EVRCameraTransitionType : uint8_t
{
	Invalid                        = 0,
	CameraRotate                   = 1,
	CameraTeleport                 = 2,
	CameraGravity                  = 3,
	TOTAL                          = 4,
	EVRCameraTransitionType_MAX    = 5
};


// Enum WKND.EHotSpotType
enum class EHotSpotType : uint8_t
{
	Melee                          = 0,
	Ranged                         = 1,
	EHotSpotType_MAX               = 2
};


// Enum WKND.EHandInteractionType
enum class EHandInteractionType : uint8_t
{
	HandInteraction_Left           = 0,
	HandInteraction_Right          = 1,
	HandInteraction_Either         = 2,
	HandInteraction_None           = 3,
	HandInteraction_MAX            = 4
};


// Enum WKND.EBoxInteractionType
enum class EBoxInteractionType : uint8_t
{
	BoxInteraction_Hand            = 0,
	BoxInteraction_Head            = 1,
	BoxInteraction_Both            = 2,
	BoxInteraction_MAX             = 3
};


// Enum WKND.EHandSyncState
enum class EHandSyncState : uint8_t
{
	SyncState_Ready                = 0,
	SyncState_Syncing              = 1,
	SyncState_Interacting          = 2,
	SyncState_MAX                  = 3
};


// Enum WKND.ESyncDirection
enum class ESyncDirection : uint8_t
{
	SyncDirection_None             = 0,
	SyncDirection_To               = 1,
	SyncDirection_From             = 2,
	SyncDirection_Both             = 3,
	SyncDirection_Break            = 4,
	SyncDirection_MAX              = 5
};


// Enum WKND.ESyncInterpType
enum class ESyncInterpType : uint8_t
{
	Interp_Snap                    = 0,
	Interp_Linear                  = 1,
	Interp_Quadratic               = 2,
	Interp_Linear_TwoStep          = 3,
	Interp_MAX                     = 4
};


// Enum WKND.EInteractionType
enum class EInteractionType : uint8_t
{
	Interaction_None               = 0,
	Interaction_Once               = 1,
	Interaction_Continuous         = 2,
	Interaction_MAX                = 3
};


// Enum WKND.EWKNDLocomotionControlScheme
enum class EWKNDLocomotionControlScheme : uint8_t
{
	LocomoteWithUserSettings       = 0,
	OriginalWKNDScheme             = 1,
	OculusScheme                   = 2,
	NewWKNDScheme                  = 3,
	SlideLocomotion                = 4,
	ThrottleLocomotion             = 5,
	EWKNDLocomotionControlScheme_MAX = 6
};


// Enum WKND.ELookAtFadeType
enum class ELookAtFadeType : uint8_t
{
	Hermite                        = 0,
	Linear                         = 1,
	Leaky                          = 2,
	ELookAtFadeType_MAX            = 3
};


// Enum WKND.ELookAtTargetType
enum class ELookAtTargetType : uint8_t
{
	Static_Pos                     = 0,
	Dynamic_HMD_Pos                = 1,
	Dynamic_HMD_Relative_Pos       = 2,
	Dynamic_Actor_Pos              = 3,
	Dynamic_Actor_Relative_Pos     = 4,
	Dynamic_Skeletal_Bone_Pos      = 5,
	Dynamic_Skeletal_Bone_Relative_Pos = 6,
	ELookAtTargetType_MAX          = 7
};


// Enum WKND.EButtonState
enum class EButtonState : uint8_t
{
	VE_IDLE                        = 0,
	VE_PRESSED                     = 1,
	VE_MAX                         = 2
};


// Enum WKND.EMenuButtonState
enum class EMenuButtonState : uint8_t
{
	BSE_IDLE                       = 0,
	BSE_PRESSED                    = 1,
	BSE_MAX                        = 2
};


// Enum WKND.ETickState
enum class ETickState : uint8_t
{
	VE_UNTICKED                    = 0,
	VE_TICKED                      = 1,
	VE_MAX                         = 2
};


// Enum WKND.ENTHapticEventType
enum class ENTHapticEventType : uint8_t
{
	NTAxisEvent_Enter              = 0,
	NTAxisEvent_Exit               = 1,
	NTAxisEvent_Both               = 2,
	NTAxisEvent_MAX                = 3
};


// Enum WKND.ENTHapticAxisType
enum class ENTHapticAxisType : uint8_t
{
	NTAxisHapticAxisType_Increment = 0,
	NTAxisHapticAxisType_Stretch   = 1,
	NTAxisHapticAxisType_Delta     = 2,
	NTAxisHapticAxisType_Delta_Stretch = 3,
	NTAxisHapticAxisType_MAX       = 4
};


// Enum WKND.ENTHapticAxis
enum class ENTHapticAxis : uint8_t
{
	NTAxis_X                       = 0,
	NTAxis_Y                       = 1,
	NTAxis_Z                       = 2,
	NTAxis_Yaw                     = 3,
	NTAxis_Pitch                   = 4,
	NTAxis_Roll                    = 5,
	NTAxis_FreeMode                = 6,
	NTAxis_MAX                     = 7
};


// Enum WKND.ENTHapticBlendType
enum class ENTHapticBlendType : uint8_t
{
	HapticBlend_Accumulate         = 0,
	HapticBlend_Highest            = 1,
	HapticBlend_Mean               = 2,
	HapticBlend_MAX                = 3
};


// Enum WKND.EPlayerClimbState
enum class EPlayerClimbState : uint8_t
{
	CLIMB_NotClimbing              = 0,
	CLIMB_OneHanded                = 1,
	CLIMB_TwoHanded                = 2,
	CLIMB_TransitionOneHand        = 3,
	CLIMB_TransitionTwoHand        = 4,
	CLIMB_MAX                      = 5
};


// Enum WKND.EConditionComparisonType
enum class EConditionComparisonType : uint8_t
{
	Equal                          = 0,
	Different                      = 1,
	HigherThan                     = 2,
	HigherThanOrEqualTo            = 3,
	LowerThan                      = 4,
	LowerThanOrEqualTo             = 5,
	EConditionComparisonType_MAX   = 6
};


// Enum WKND.EWaveMedalConditionType
enum class EWaveMedalConditionType : uint8_t
{
	RemainingPlayerHealthLevels    = 0,
	PlayerHitReceived              = 1,
	WaveCompletionTime             = 2,
	RemoteDronesDestroyed          = 3,
	TrainingDroidsDestroyed        = 4,
	CorvaxDroidsDestroyed          = 5,
	TotalDestroyed                 = 6,
	EWaveMedalConditionType_MAX    = 7
};


// Enum WKND.EEnemyType
enum class EEnemyType : uint8_t
{
	Unknown                        = 0,
	RemoteDrone                    = 1,
	TrainingDroid                  = 2,
	CorvaxDroid                    = 3,
	AssassinDroid                  = 4,
	EEnemyType_MAX                 = 5
};


// Enum WKND.ERewardType
enum class ERewardType : uint8_t
{
	KyberCrystal                   = 0,
	LightsaberHilt                 = 1,
	Environment                    = 2,
	Tip                            = 3,
	Achievement                    = 4,
	ERewardType_MAX                = 5
};


// Enum WKND.EGrabResult
enum class EGrabResult : uint8_t
{
	GrabResult_Success             = 0,
	GrabResult_Failure             = 1,
	GrabResult_Failed_Already_Holding = 2,
	GrabResult_Failed_Invalid_Pickup = 3,
	GrabResult_Failed_Pickup_Refused = 4,
	GrabResult_MAX                 = 5
};


// Enum WKND.ECombatStageStatus
enum class ECombatStageStatus : uint8_t
{
	Invalid                        = 0,
	Ready                          = 1,
	Active                         = 2,
	ECombatStageStatus_MAX         = 3
};


// Enum WKND.ECombatStage_Duel_Reaction
enum class ECombatStage_Duel_Reaction : uint8_t
{
	NoReaction                     = 0,
	Taunt                          = 1,
	Recoil                         = 2,
	ECombatStage_Duel_MAX          = 3
};


// Enum WKND.EParryMode
enum class EParryMode : uint8_t
{
	NotParriable                   = 0,
	OnlyHeavyAttacksParriable      = 1,
	AllAttacksParriable            = 2,
	EParryMode_MAX                 = 3
};


// Enum WKND.ECombatComboWeight
enum class ECombatComboWeight : uint8_t
{
	Light                          = 0,
	Heavy                          = 1,
	Clash                          = 2,
	Undefined                      = 3,
	ECombatComboWeight_MAX         = 4
};


// Enum WKND.EGripAdjustType
enum class EGripAdjustType : uint8_t
{
	FullFreedom                    = 0,
	Axis_X                         = 1,
	Axis_Y                         = 2,
	Axis_Z                         = 3,
	EGripAdjustType_MAX            = 4
};


// Enum WKND.EGrabHand
enum class EGrabHand : uint8_t
{
	GrabHand_Left                  = 0,
	GrabHand_Right                 = 1,
	GrabHand_Buddy                 = 2,
	GrabHand_Any                   = 3,
	GrabHand_MAX                   = 4
};


// Enum WKND.EGrabType
enum class EGrabType : uint8_t
{
	GrabType_Pickup                = 0,
	GrabType_Climb                 = 1,
	GrabType_Max                   = 2
};


// Enum WKND.ESearchType
enum class ESearchType : uint8_t
{
	Regular                        = 0,
	KeepLatest                     = 1,
	Disabled                       = 2,
	ButtonsOnly                    = 3,
	InteractionsOnly               = 4,
	ESearchType_MAX                = 5
};


// Enum WKND.EHandOrientationAxis
enum class EHandOrientationAxis : uint8_t
{
	PositiveX                      = 0,
	PositiveY                      = 1,
	PositiveZ                      = 2,
	NegativeX                      = 3,
	NegativeY                      = 4,
	NegativeZ                      = 5,
	EHandOrientationAxis_MAX       = 6
};


// Enum WKND.EHandEnvironmentInteractionMode
enum class EHandEnvironmentInteractionMode : uint8_t
{
	IgnoreWhenEmptyHanded          = 0,
	GhostSimple                    = 1,
	GhostPrecise                   = 2,
	Block                          = 3,
	Ignore                         = 4,
	EHandEnvironmentInteractionMode_MAX = 5
};


// Enum WKND.EIntersectRepelantTarget
enum class EIntersectRepelantTarget : uint8_t
{
	IntersectRepelantTarget_Controller = 0,
	IntersectRepelantTarget_Socket = 1,
	IntersectRepelantTarget_MAX    = 2
};


// Enum WKND.EIntersectRepelantStart
enum class EIntersectRepelantStart : uint8_t
{
	IntersectRepelantType_Eye      = 0,
	IntersectRepelantType_Socket   = 1,
	IntersectRepelantType_MAX      = 2
};


// Enum WKND.ERPOCMappingType
enum class ERPOCMappingType : uint8_t
{
	Action                         = 0,
	Axis                           = 1,
	ERPOCMappingType_MAX           = 2
};


// Enum WKND.ESaberGameState
enum class ESaberGameState : uint8_t
{
	ESaberGameState_NoChange       = 0,
	SaberGameState_Off             = 1,
	SaberGameState_On              = 2,
	SaberState_Max                 = 3,
	ESaberGameState_MAX            = 4
};


// Enum WKND.ELightsaberState
enum class ELightsaberState : uint8_t
{
	SaberState_NoChange            = 0,
	SaberState_PowerOff            = 1,
	SaberState_PowerDown           = 2,
	SaberState_PowerDelimeter      = 3,
	SaberState_PowerUp             = 4,
	SaberState_PowerOn             = 5,
	SaberState_Max                 = 6
};


// Enum WKND.EPickupMode
enum class EPickupMode : uint8_t
{
	Sticky                         = 0,
	HoldToCarry                    = 1,
	EPickupMode_MAX                = 2
};


// Enum WKND.EDeviceType
enum class EDeviceType : uint8_t
{
	SaberPartType_CrossGuard       = 0,
	SaberPartType_Crystal          = 1,
	SaberPartType_Directors        = 2,
	SaberPartType_MAX              = 3
};


// Enum WKND.EStagedCombat_StageCompleteBehaviour
enum class EStagedCombat_StageCompleteBehaviour : uint8_t
{
	EndStage                       = 0,
	MaintainPosition               = 1,
	Idle                           = 2,
	EStagedCombat_MAX              = 3
};


// Enum WKND.ECombatStageMovementOptions
enum class ECombatStageMovementOptions : uint8_t
{
	Default                        = 0,
	FacePlayer                     = 1,
	IgnorePosition                 = 2,
	ECombatStageMovementOptions_MAX = 3
};


// Enum WKND.ECombatStage_Taunt
enum class ECombatStage_Taunt : uint8_t
{
	NoTaunt                        = 0,
	Short                          = 1,
	Long                           = 2,
	ECombatStage_MAX               = 3
};


// Enum WKND.ECombatStage_Duel_Phase
enum class ECombatStage_Duel_Phase : uint8_t
{
	Undefined                      = 0,
	Attack                         = 1,
	Block                          = 2,
	Damaged                        = 3,
	Evade                          = 4,
	Regroup                        = 5,
	Stunned                        = 6,
	SuperStunned                   = 7,
	Taunt                          = 8,
	Vulnerable                     = 9,
	ECombatStage_Duel_MAX          = 10
};


// Enum WKND.EDebugType
enum class EDebugType : uint8_t
{
	None                           = 0,
	SingleBone                     = 1,
	AllBones                       = 2,
	EDebugType_MAX                 = 3
};


// Enum WKND.ESkeletonOrientation
enum class ESkeletonOrientation : uint8_t
{
	UpForward                      = 0,
	UpLeft                         = 1,
	UpRight                        = 2,
	UpBackward                     = 3,
	DownForward                    = 4,
	DownLeft                       = 5,
	DownRight                      = 6,
	DownBackward                   = 7,
	ESkeletonOrientation_MAX       = 8
};


// Enum WKND.ESliceableBoneAxis
enum class ESliceableBoneAxis : uint8_t
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	NX                             = 3,
	NY                             = 4,
	NZ                             = 5,
	TOTAL                          = 6,
	ESliceableBoneAxis_MAX         = 7
};


// Enum WKND.ESplineFlightProgress
enum class ESplineFlightProgress : uint8_t
{
	Perching                       = 0,
	FlyingToLoop                   = 1,
	Looping                        = 2,
	FlyingToAttack                 = 3,
	Attacking                      = 4,
	NoChange                       = 5,
	ESplineFlightProgress_MAX      = 6
};


// Enum WKND.EVaderCell_State
enum class EVaderCell_State : uint8_t
{
	None                           = 0,
	StartSequence                  = 1,
	EnterCell                      = 2,
	InCell_Idle                    = 3,
	InCell_Turn                    = 4,
	InCell_Step                    = 5,
	ExitCell                       = 6,
	EVaderCell_MAX                 = 7
};


// Enum WKND.ETrackedBoneParent
enum class ETrackedBoneParent : uint8_t
{
	DirectParent                   = 0,
	World                          = 1,
	UseParentBoneName              = 2,
	ETrackedBoneParent_MAX         = 3
};


// Enum WKND.ECheckpointTeleporterState
enum class ECheckpointTeleporterState : uint8_t
{
	Idle                           = 0,
	InvokedTeleport                = 1,
	WaitingForLevelLoad            = 2,
	WaitingForLevelResponse        = 3,
	WaitingForTextureStreaming     = 4,
	ECheckpointTeleporterState_MAX = 5
};


// Enum WKND.ETutorialStage
enum class ETutorialStage : uint8_t
{
	ETTS_StepByStep                = 0,
	ETTS_WholeFlow                 = 1,
	ETTS_MAX                       = 2
};


// Enum WKND.ETutorialButton
enum class ETutorialButton : uint8_t
{
	ETB_None                       = 0,
	ETB_Casing                     = 1,
	ETB_Grip                       = 2,
	ETB_Trigger                    = 3,
	ETB_Face1                      = 4,
	ETB_Face2                      = 5,
	ETB_Home                       = 6,
	ETB_Thumbstick                 = 7,
	ETB_Thumbstick_ArrowLeft       = 8,
	ETB_Thumbstick_ArrowRight      = 9,
	ETB_Thumbstick_ArrowUp         = 10,
	ETB_Thumbstick_ArrowDown       = 11,
	ETB_MAX                        = 12
};


// Enum WKND.EWKNDEnemyRoutePlanner_PathSegmentBehaviour
enum class EWKNDEnemyRoutePlanner_PathSegmentBehaviour : uint8_t
{
	Default                        = 0,
	Defensive                      = 1,
	EWKNDEnemyRoutePlanner_MAX     = 2
};


// Enum WKND.EWKNDEnemyRoutePlanner_PathSegmentType
enum class EWKNDEnemyRoutePlanner_PathSegmentType : uint8_t
{
	Straight                       = 0,
	Circle                         = 1,
	Spiral                         = 2,
	Spin                           = 3,
	EWKNDEnemyRoutePlanner_MAX     = 4
};


// Enum WKND.ETeleportUIState
enum class ETeleportUIState : uint8_t
{
	Inactive                       = 0,
	Disabled                       = 1,
	Incomplete                     = 2,
	Invalid                        = 3,
	Valid                          = 4,
	SnapPoint                      = 5,
	Story                          = 6,
	ETeleportUIState_MAX           = 7
};


// Enum WKND.EMovementContext
enum class EMovementContext : uint8_t
{
	None                           = 0,
	Creep                          = 1,
	Walk                           = 2,
	Run                            = 3,
	EMovementContext_MAX           = 4
};


// Enum WKND.EGraphicsSetting
enum class EGraphicsSetting : uint8_t
{
	GSE_Minimum                    = 0,
	GSE_Recommended                = 1,
	GSE_MAX                        = 2
};


// Enum WKND.ESoundChannel
enum class ESoundChannel : uint8_t
{
	ESC_Master                     = 0,
	ESC_Voice                      = 1,
	ESC_Music                      = 2,
	ESC_SFX                        = 3,
	ESC_MAX                        = 4
};


// Enum WKND.EComfortDamageIndicatorEnum
enum class EComfortDamageIndicatorEnum : uint8_t
{
	CDIE_Reduced                   = 0,
	CDIE_Standard                  = 1,
	CDIE_MAX                       = 2
};


// Enum WKND.EVRInstantSnapTurns
enum class EVRInstantSnapTurns : uint8_t
{
	SnapTurns_Instant              = 0,
	SnapTurns_Lerp                 = 1,
	SnapTurns_MAX                  = 2
};


// Enum WKND.EVRCameraShakeEnum
enum class EVRCameraShakeEnum : uint8_t
{
	CameraShake_Prevented          = 0,
	CameraShake_Allowed            = 1,
	CameraShake_MAX                = 2
};


// Enum WKND.ESubtitlesEnum
enum class ESubtitlesEnum : uint8_t
{
	SubtitlesE_On                  = 0,
	SubtitlesE_Off                 = 1,
	SubtitlesE_MAX                 = 2
};


// Enum WKND.E360CombatEnum
enum class E360CombatEnum : uint8_t
{
	E360CE_On                      = 0,
	E360CE_Off                     = 1,
	E360CE_MAX                     = 2
};


// Enum WKND.EVisualCombatAssistEnum
enum class EVisualCombatAssistEnum : uint8_t
{
	VCAE_On                        = 0,
	VCAE_Off                       = 1,
	VCAE_MAX                       = 2
};


// Enum WKND.EVRModeEnum
enum class EVRModeEnum : uint8_t
{
	VME_Seated                     = 0,
	VME_Standing                   = 1,
	VME_MAX                        = 2
};


// Enum WKND.ELocomotionModeEnum
enum class ELocomotionModeEnum : uint8_t
{
	LME_Teleport                   = 0,
	LME_Throttle                   = 1,
	LME_MAX                        = 2
};


// Enum WKND.EComfortLevelEnum
enum class EComfortLevelEnum : uint8_t
{
	CLE_Comfortable                = 0,
	CLE_Standard                   = 1,
	CLE_Custom                     = 2,
	CLE_MAX                        = 3
};


// Enum WKND.EWKNDHands
enum class EWKNDHands : uint8_t
{
	Hands_Left                     = 0,
	Hands_Right                    = 1,
	Hands_Both                     = 2,
	Hands_MAX                      = 3
};


// Enum WKND.EDisarmType
enum class EDisarmType : uint8_t
{
	DisarmType_Left                = 0,
	DisarmType_Right               = 1,
	DisarmType_Both                = 2,
	DisarmType_MAX                 = 3
};


// Enum WKND.EHandPosition
enum class EHandPosition : uint8_t
{
	MainRight                      = 0,
	MainLeft                       = 1,
	OffRight                       = 2,
	OffLeft                        = 3,
	None                           = 4,
	EHandPosition_MAX              = 5
};


// Enum WKND.EHoldType
enum class EHoldType : uint8_t
{
	Default                        = 0,
	SimpleGun                      = 1,
	EHoldType_MAX                  = 2
};


// Enum WKND.EWeaponType
enum class EWeaponType : uint8_t
{
	Melee                          = 0,
	Ranged                         = 1,
	Throwing                       = 2,
	EWeaponType_MAX                = 3
};


// Enum WKND.EQueryResult
enum class EQueryResult : uint8_t
{
	EQR_Failed                     = 0,
	EQR_Success                    = 1,
	EQR_MAX                        = 2
};


// Enum WKND.EPlayerHandImpact
enum class EPlayerHandImpact : uint8_t
{
	EPHI_Hand                      = 0,
	EPHI_Saber                     = 1,
	EPHI_Tool                      = 2,
	EPHI_Other                     = 3,
	EPHI_MAX                       = 4
};


// Enum WKND.EGrabbableCategory
enum class EGrabbableCategory : uint8_t
{
	EGC_None                       = 0,
	EGC_Saber                      = 1,
	EGC_Chalice                    = 2,
	EGC_MAX                        = 3
};


// Enum WKND.EGrabbingState
enum class EGrabbingState : uint8_t
{
	EGS_EmptyHanded                = 0,
	EGS_PickingUp                  = 1,
	EGS_Holding                    = 2,
	EGS_Recovering                 = 3,
	EGS_MAX                        = 4
};


// Enum WKND.EActorSide
enum class EActorSide : uint8_t
{
	EAS_Random                     = 0,
	EAS_Left                       = 1,
	EAS_Right                      = 2,
	EAS_MAX                        = 3
};


// Enum WKND.EShotSpecifier
enum class EShotSpecifier : uint8_t
{
	ESS_ShootNormal                = 0,
	ESS_ShootInstant               = 1,
	ESS_MAX                        = 2
};


// Enum WKND.EWKNDGrabType
enum class EWKNDGrabType : uint8_t
{
	Grip                           = 0,
	Pinch                          = 1,
	Both                           = 2,
	EWKNDGrabType_MAX              = 3
};


// Enum WKND.EHandAttachState
enum class EHandAttachState : uint8_t
{
	EHAS_NotAttached               = 0,
	EHAS_Controller                = 1,
	EHAS_HeldObject                = 2,
	EHAS_MAX                       = 3
};


// Enum WKND.EHapticType
enum class EHapticType : uint8_t
{
	EShort                         = 0,
	ELong                          = 1,
	ECrescendo                     = 2,
	EDiminishing                   = 3,
	EPeak                          = 4,
	ERhythmic                      = 5,
	ESubtle                        = 6,
	EHapticType_MAX                = 7
};


// Enum WKND.EGripState
enum class EGripState : uint8_t
{
	Open                           = 0,
	CanGrab                        = 1,
	CanRelease                     = 2,
	Grab                           = 3,
	TwoHandGrab                    = 4,
	Squeeze                        = 5,
	Backhand                       = 6,
	EGripState_MAX                 = 7
};


// Enum WKND.EControllerState
enum class EControllerState : uint8_t
{
	ECS_EmptyHanded                = 0,
	ECS_Interacting                = 1,
	ECS_Climbing                   = 2,
	ECS_Recovering                 = 3,
	ECS_ForceGrabbbing             = 4,
	ECS_HoldingDelimiter           = 5,
	ECS_HoldingAsPrimaryHand       = 6,
	ECS_HoldingAsSecondaryHand     = 7,
	ECS_MAX                        = 8
};


// Enum WKND.ECameraMobility
enum class ECameraMobility : uint8_t
{
	Mobile                         = 0,
	FullyFrozen                    = 1,
	RecenterOnRotate               = 2,
	ConstrainedToRadius            = 3,
	ECameraMobility_MAX            = 4
};


// Enum WKND.EControllerType
enum class EControllerType : uint8_t
{
	Oculus                         = 0,
	Vive                           = 1,
	XBox                           = 2,
	SteamPad                       = 3,
	PS4Move                        = 4,
	PS4GamePad                     = 5,
	Unknown                        = 6,
	TOTAL                          = 7,
	EControllerType_MAX            = 8
};


// Enum WKND.EAISquadAction
enum class EAISquadAction : uint8_t
{
	SquadOpened                    = 0,
	SquadAlreadyOpen               = 1,
	EmptySquadClosed               = 2,
	ActiveSquadClosed              = 3,
	SquadNotFound                  = 4,
	EAISquadAction_MAX             = 5
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct WKND.PickupData
// 0x0028
struct FPickupData
{
	EGrabHand                                          Hand;                                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class USceneComponent*                             AttachTo;                                                 // 0x0008(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               RangeLimitedGrab;                                         // 0x0010(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               SnapToHand;                                               // 0x0011(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0012(0x0002) MISSED OFFSET
	float                                              maximumGrabRange;                                         // 0x0014(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       SocketName;                                               // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ReverseGrip;                                              // 0x0020(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Ranged;                                                   // 0x0021(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Swap;                                                     // 0x0022(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x0023(0x0005) MISSED OFFSET
};

// ScriptStruct WKND.MovementParams
// 0x0010
struct FMovementParams
{
	float                                              MaxVelocity;                                              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxAcceleration;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDeceleration;                                          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AcceptanceRadius;                                         // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct WKND.AutomatedPerformanceCaptureLocation
// 0x0058
struct FAutomatedPerformanceCaptureLocation
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WKND.AutomatedPerformanceCaptureLocation.TargetPoint
	class UWKNDProgressionCheckpointData*              CheckpointData;                                           // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FString                                     LocationNameOverride;                                     // 0x0030(0x0010) (Edit, ZeroConstructor)
	bool                                               bForceIgnoreZoe;                                          // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bLeavePlayerAndCameraUnchangedAfterTeleport;              // 0x0041(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0042(0x0006) MISSED OFFSET
	TArray<class UAutomatedPerformanceCaptureUserCommand*> UserCommands;                                             // 0x0048(0x0010) (Edit, ExportObject, ZeroConstructor)
};

// ScriptStruct WKND.BuddyIdleAnim
// 0x0020
struct FBuddyIdleAnim
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	class UAnimMontage*                                Montage;                                                  // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  Dialogue;                                                 // 0x0010(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ReplayAllowed;                                            // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               OverrideCooldownDuration;                                 // 0x0019(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
	float                                              CooldownDuration;                                         // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct WKND.MeshWithSocket
// 0x0010
struct FMeshWithSocket
{
	class USceneComponent*                             Mesh;                                                     // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct WKND.PressedButtonComponent
// 0x0018
struct FPressedButtonComponent
{
	class UMenuButtonComponent*                        PressedButtonComponent;                                   // 0x0000(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontendInteractionController*              Controller;                                               // 0x0008(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bPlayAudioOnChange;                                       // 0x0010(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIssuedFromConsole;                                       // 0x0011(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0012(0x0006) MISSED OFFSET
};

// ScriptStruct WKND.ChangedMenuComponent
// 0x0010
struct FChangedMenuComponent
{
	class UMenuBaseComponent*                          ChangedComponent;                                         // 0x0000(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bPlayAudioOnChange;                                       // 0x0008(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIssuedFromConsole;                                       // 0x0009(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
};

// ScriptStruct WKND.AttachedMenuElement
// 0x0010
struct FAttachedMenuElement
{
	class UMenuBaseComponent*                          MenuComponent;                                            // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                HierarchyNumber;                                          // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct WKND.OneToOnePair
// 0x0008
struct FOneToOnePair
{
	float                                              OneToOneness;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               EffectsNegative;                                          // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
};

// ScriptStruct WKND.KFCircleCombatPoint
// 0x0048
struct FKFCircleCombatPoint
{
	int                                                ID;                                                       // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0004(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WKND.KFCircleCombatPoint.TargetPoint
	float                                              Angle;                                                    // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RangedDistanceOffset;                                     // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RangedHeightOffset;                                       // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	ENPCCombatType                                     NPCCombatType;                                            // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	TWeakObjectPtr<class UObject>                      CurrentOwner;                                             // 0x0040(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct WKND.WKNDDamageInfo
// 0x0038
struct FWKNDDamageInfo
{
	EDamageType                                        Type;                                                     // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EDamageStrength                                    Strength;                                                 // 0x0001(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FVector                                     HitLocation;                                              // 0x0004(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     HitDirection;                                             // 0x0010(0x000C) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class UStaticMeshComponent*                        HitArmorPiece;                                            // 0x0020(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bTwoHandedHit;                                            // 0x0028(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	class AActor*                                      HitActor;                                                 // 0x0030(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct WKND.CorvaxianBoxPiston
// 0x0020
struct FCorvaxianBoxPiston
{
	struct FName                                       BoneName;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	ECorvaxianBoxAnimationMode                         Mode;                                                     // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              CurrentProgress;                                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     StartingLocation;                                         // 0x0010(0x000C) (IsPlainOldData)
	float                                              SpeedMultiplier;                                          // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct WKND.TrackingData
// 0x0030
struct FTrackingData
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct WKND.MotionMonitorData
// 0x0020
struct FMotionMonitorData
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct WKND.ForceItemCandidate
// 0x0028
struct FForceItemCandidate
{
	bool                                               IsValid;                                                  // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UForceItemComponentBase*                     ForceItem;                                                // 0x0008(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	EControllerHand                                    Hand;                                                     // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              MinControllerDistanceFromHeadset;                         // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxControllerDistanceFromHeadset;                         // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Score;                                                    // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DurationActive;                                           // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct WKND.GhostMaterialStruct
// 0x0010
struct FGhostMaterialStruct
{
	class UMaterialInterface*                          GhostMaterial;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaterialSlot;                                             // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct WKND.GrabbableCrankingPoint
// 0x00B0
struct FGrabbableCrankingPoint
{
	struct FName                                       EmitterTag;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BoneName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ConstrainRotationalAngle;                                 // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector2D                                   MinMaxAngleConstraint;                                    // 0x0014(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	TEnumAsByte<EAxis>                                 BoneRotationalAxis;                                       // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EAllowedRotationDirection                          AllowedRotationDirection;                                 // 0x001D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               FreezeHandRotationDuringCrank;                            // 0x001E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x001F(0x0001) MISSED OFFSET
	class USceneComponent*                             Emitter;                                                  // 0x0020(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TScriptInterface<class UXLABInteractionHandler>    InteractionHandler;                                       // 0x0028(0x0010) (ZeroConstructor, IsPlainOldData)
	bool                                               IsGrabbed;                                                // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsLockedAtCurrentRotation;                                // 0x0039(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	struct FQuat                                       BoneRotationAtBeginPlay;                                  // 0x0040(0x0010) (IsPlainOldData)
	struct FQuat                                       StartingBoneRotationOnGrab;                               // 0x0050(0x0010) (IsPlainOldData)
	struct FQuat                                       StartingEmitterRotationOnGrab;                            // 0x0060(0x0010) (IsPlainOldData)
	struct FVector                                     BoneRotationalAxisVector;                                 // 0x0070(0x000C) (IsPlainOldData)
	struct FVector                                     BoneLocation;                                             // 0x007C(0x000C) (IsPlainOldData)
	float                                              StartingAngle;                                            // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     StartingHandLocation;                                     // 0x008C(0x000C) (IsPlainOldData)
	struct FVector                                     StartingHandRotationalCenter;                             // 0x0098(0x000C) (IsPlainOldData)
	float                                              LastFrameOffsetAngle;                                     // 0x00A4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedCrankAngle;                                    // 0x00A8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
};

// ScriptStruct WKND.GrabbableDeformerPoint
// 0x0130
struct FGrabbableDeformerPoint
{
	struct FName                                       EmitterTag;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       MorphTargetName;                                          // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRuntimeFloatCurve                          ControllerTranslationToEmitterTranslation;                // 0x0010(0x0078) (Edit, BlueprintVisible)
	struct FRuntimeFloatCurve                          EmitterTranslationToDeformityCurve;                       // 0x0088(0x0078) (Edit, BlueprintVisible)
	float                                              BreakAwayDistance;                                        // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0104(0x0004) MISSED OFFSET
	class USceneComponent*                             Emitter;                                                  // 0x0108(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UArrowComponent*                             Arrow;                                                    // 0x0110(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              CurrentEmitterDistance;                                   // 0x0118(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CurrentDeformationAmount;                                 // 0x011C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0120(0x0010) MISSED OFFSET
};

// ScriptStruct WKND.GrabbableMoverPoint
// 0x0068
struct FGrabbableMoverPoint
{
	struct FName                                       EmitterTag;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BoneName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAxis>                                 BoneAxis;                                                 // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FVector2D                                   MinMaxTranslationConstraint;                              // 0x0014(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	class USceneComponent*                             Emitter;                                                  // 0x0020(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TScriptInterface<class UXLABInteractionHandler>    InteractionHandler;                                       // 0x0028(0x0010) (ZeroConstructor, IsPlainOldData)
	bool                                               IsGrabbed;                                                // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               IsLockedAtCurrentLocation;                                // 0x0039(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x003A(0x0002) MISSED OFFSET
	struct FVector                                     StartingEmitterLocation;                                  // 0x003C(0x000C) (IsPlainOldData)
	struct FVector                                     StartingControllerLocation;                               // 0x0048(0x000C) (IsPlainOldData)
	struct FVector                                     StartingBoneLocation;                                     // 0x0054(0x000C) (IsPlainOldData)
	float                                              StartingBoneDistance;                                     // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
};

// ScriptStruct WKND.GrabbableSpinnerPoint
// 0x00D8
struct FGrabbableSpinnerPoint
{
	struct FName                                       EmitterTag;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BoneName;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAxis>                                 RotationalAxis;                                           // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
