#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class WKND.AIDebugRenderer
// 0x0000 (0x00F0 - 0x00F0)
class UAIDebugRenderer : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIDebugRenderer");
		return ptr;
	}


	bool STATIC_GetAIDebugRender();
};


// Class WKND.WKNDGrabberComponent
// 0x0080 (0x0310 - 0x0290)
class UWKNDGrabberComponent : public USceneComponent
{
public:
	struct FScriptMulticastDelegate                    OnGrabbed;                                                // 0x0290(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDropped;                                                // 0x02A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               HoldsLoosely;                                             // 0x02B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02B1(0x0003) MISSED OFFSET
	float                                              grabRadius;                                               // 0x02B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ignoreRadiusOnGrab;                                       // 0x02B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x02B9(0x0003) MISSED OFFSET
	float                                              GrabbingTime;                                             // 0x02BC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RecoveryTime;                                             // 0x02C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x02C4(0x0004) MISSED OFFSET
	class AActor*                                      HeldObject;                                               // 0x02C8(0x0008) (ZeroConstructor, IsPlainOldData)
	class URPOCGrabLocatorComponent*                   GrabLocator;                                              // 0x02D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FPickupData                                 CurrentPickupData;                                        // 0x02D8(0x0028)
	EGrabHand                                          Hand;                                                     // 0x0300(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0xF];                                       // 0x0301(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.WKNDGrabberComponent");
		return ptr;
	}


	void Update(float DeltaTime);
	void SetHoldsLoosely(bool Value);
	void SetHandType(EGrabHand Type);
	void Reset();
	bool IsInState(EGrabbingState TestState);
	bool IsHoldingSomething();
	EGrabHand HandType();
	bool Grab(class AActor* actorToGrab, class URPOCGrabLocatorComponent* Locator);
	EGrabbingState GetHoldState();
	class AActor* GetHeldObject();
	class URPOCGrabLocatorComponent* GetGrabLocator();
	float GetGrabbingTime();
	bool Drop(bool GoIntoRecoveryState, bool preventImpulse);
	bool STATIC_Debugging();
};


// Class WKND.AIGrabberComponent
// 0x0000 (0x0310 - 0x0310)
class UAIGrabberComponent : public UWKNDGrabberComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIGrabberComponent");
		return ptr;
	}


	bool Drop(bool GoIntoRecoveryState, bool preventImpulse);
};


// Class WKND.AIInstructionComponent
// 0x0108 (0x01F8 - 0x00F0)
class UAIInstructionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x00F0(0x00D0) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnInteractionRejected;                                    // 0x01C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               DebugInstructions;                                        // 0x01D0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugSignals;                                             // 0x01D1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugCurrentInteraction;                                  // 0x01D2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x25];                                      // 0x01D3(0x0025) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIInstructionComponent");
		return ptr;
	}


	void SetSignal(const struct FName& SignalName);
	void RunInstructions();
	void InternalEnqueueStatusCheckInstruction(EAIStatusCheckType StatusCheck, const struct FLatentActionInfo& LatentInfo);
	void STATIC_InternalEnqueueCallbackInstruction(class UAIInstructionComponent* InstructionComp, const struct FLatentActionInfo& LatentInfo);
	void ImmediateStopMontage(class UAnimMontage* Montage, float BlendTime);
	bool HasInstructions();
	struct FName GetInteractionStartedName();
	struct FName GetInteractionFailedName();
	struct FName GetInteractionCompleteName();
	struct FName GetFlyCompleteName();
	class UAIInstructionComponent* ForgetAllInstructions();
	struct FVector FeetToRoot(const struct FVector& feetVector);
	class UAIInstructionComponent* EnqueueWaitOnSignalInstruction(const struct FName& SignalName, bool ClearSignalAtStart);
	class UAIInstructionComponent* EnqueueWaitOnCountdownTimerInstruction(const struct FName& TimerName);
	class UAIInstructionComponent* EnqueueWaitInstruction(bool WaitForever, float WaitSeconds);
	class UAIInstructionComponent* EnqueueWaitForMontageToFinishInstruction(class UAnimMontage* Montage);
	class UAIInstructionComponent* EnqueueWaitForDialogueToFinishInstruction();
	class UAIInstructionComponent* EnqueueUseInteractableInstruction();
	class UAIInstructionComponent* EnqueueUberMove(const struct FVector& Destination, const struct FRotator& Facing, bool alignOnComplete, float ThresholdDistance, float ThresholdAngle, EAIMovementOverride moveOverride, EBuddyAIMovementType moveType);
	class UAIInstructionComponent* EnqueueTurnToOrientationInstruction(const struct FRotator& Orientation, float ThresholdAngle);
	class UAIInstructionComponent* EnqueueTurnToInstruction(const struct FVector& Target, float ThresholdAngle);
	class UAIInstructionComponent* EnqueueThrowMontageInstruction(const struct FVector& toThrow, class UAnimMontage* Montage, float Speed, float longRange);
	class UAIInstructionComponent* EnqueueThrowImmediateInstruction(const struct FVector& toThrow, float Speed, float longRange);
	class UAIInstructionComponent* EnqueueThrowHeldPickupInstruction(const struct FVector& toThrow, float Speed, bool rotateFirst, bool waitForComplete, EAIThrowSelection throwOverride);
	class UAIInstructionComponent* EnqueueStartMontageInstruction(class UAnimMontage* Montage, bool stopOnCleanup, const struct FName& StartingSection, bool overrideBlend, float blendOverride);
	class UAIInstructionComponent* EnqueueStartDialogueInstruction(class USoundBase* Sound);
	class UAIInstructionComponent* EnqueueStartCountdownTimerInstruction(float Seconds, const struct FName& TimerName);
	class UAIInstructionComponent* EnqueueShootAtActorSideInstruction(class AActor* Target, TEnumAsByte<EActorSide> WhichSide);
	class UAIInstructionComponent* EnqueueShootAtActorInstruction(class AActor* Target);
	class UAIInstructionComponent* EnqueueRotateOnSpotInstruction(float angleToRotate, float rotateDuration);
	class UAIInstructionComponent* EnqueueResumeMontageInstruction(class UAnimMontage* Montage);
	class UAIInstructionComponent* EnqueueReleaseActorInstruction();
	class UAIInstructionComponent* EnqueuePlayMontageInstruction(class UAnimMontage* Montage, const struct FName& StartingSection);
	class UAIInstructionComponent* EnqueuePlayDialogueInstruction(class USoundBase* Sound);
	class UAIInstructionComponent* EnqueuePauseMontageInstruction(class UAnimMontage* Montage);
	class UAIInstructionComponent* EnqueueMoveToRunThresholdInstruction(const struct FVector& Target, float ThresholdDistance, float RunThresholdDistance);
	class UAIInstructionComponent* EnqueueMoveToInstruction(const struct FVector& Target, float ThresholdDistance, EBuddyAIMovementType MovementType);
	class UAIInstructionComponent* EnqueueMoveAndFaceInstruction(const struct FVector& Target, const struct FRotator& Facing, float ThresholdDistance);
	class UAIInstructionComponent* EnqueueMoveAndAlignToInstruction(const struct FVector& Target, const struct FRotator& Orientation, EBuddyAIMovementType MovementType, float LerpTime, EAIAlignComponent alignComponent);
	class UAIInstructionComponent* EnqueueJumpToMontageSectionInstruction(class UAnimMontage* Montage, const struct FName& SectionName, bool JumpToEnd);
	class UAIInstructionComponent* EnqueueGrabPickupInstruction(class AActor* toGrab, bool moveTo, bool rotateTo, bool waitForComplete);
	class UAIInstructionComponent* EnqueueGrabActorInstruction(class AActor* toGrab);
	class UAIInstructionComponent* EnqueueFlyToInstruction(const struct FVector& Destination, int Exp, bool waitForComplete, bool bForceFlyStraight);
	class UAIInstructionComponent* EnqueueFlyThroughPlayerSideInstruction(TEnumAsByte<EActorSide> WhichSide, bool bSmoothEnd, float SideDistance, float SideHeightRatio, float EndDistance, float EndHeight, const struct FMovementParams& MovementParams);
	class UAIInstructionComponent* EnqueueCompositeMoveInstruction(TArray<class ATargetPoint*> route);
	class UAIInstructionComponent* EnqueueAlignToInstruction(const struct FVector& Target, const struct FRotator& Orientation, float LerpTime, bool smoothCurve, EAIAlignComponent alignComponent);
	void ClearSignal(const struct FName& SignalName);
};


// Class WKND.AIPatrolComponent
// 0x0028 (0x0118 - 0x00F0)
class UAIPatrolComponent : public UActorComponent
{
public:
	bool                                               patrolRequested;                                          // 0x00F0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	EAIPatrolStart                                     patrolStartBehaviour;                                     // 0x00F1(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	EAIPatrolCorners                                   patrolCornerBehaviour;                                    // 0x00F2(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x00F3(0x0001) MISSED OFFSET
	float                                              delayAtEachPoint;                                         // 0x00F4(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	EAIPatrolEnd                                       patrolEndBehaviour;                                       // 0x00F8(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               reverseDirection;                                         // 0x00F9(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x00FA(0x0006) MISSED OFFSET
	int                                                currentPatrolIndex;                                       // 0x0100(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0104(0x0004) MISSED OFFSET
	TArray<class ATargetPoint*>                        patrolRoute;                                              // 0x0108(0x0010) (BlueprintVisible, ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIPatrolComponent");
		return ptr;
	}


	void StopPatrolling();
	bool StartPatrolling(EAIPatrolStart Start, float Delay, EAIPatrolEnd End);
	int SetPatrolRoute(TArray<class ATargetPoint*> inPatrolRoute);
	bool SetPatrolIndex(int nextIndex);
	bool MoveToPatrolPointIndex(int nextIndex);
	bool IsPatrolling();
	bool HasValidPatrolRoute();
	bool HasPatrolRequested();
	int GetPatrolLength();
	class ATargetPoint* FindPatrolPointAtIndex(int Index);
	class ATargetPoint* FindFurthestPatrolPoint(const struct FVector& toLocation);
	int FindClosestPatrolPointIndex(const struct FVector& toLocation);
};


// Class WKND.AIPositioningComponent
// 0x0070 (0x0160 - 0x00F0)
class UAIPositioningComponent : public UActorComponent
{
public:
	class UClass*                                      DefaultHotSpotLayout;                                     // 0x00F0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TMap<struct FString, class UClass*>                HotSpotLayouts;                                           // 0x00F8(0x0050) (Edit, ZeroConstructor)
	class AHotSpotLayout*                              ActiveHotSpotLayout;                                      // 0x0148(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AHotSpotActor*>                       ActiveMapHotSpots;                                        // 0x0150(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIPositioningComponent");
		return ptr;
	}


	class UAIPositioningComponent* STATIC_GetAIPositioningComponent(class APawn* Pawn);
};


// Class WKND.AIWanderVolume
// 0x0010 (0x0328 - 0x0318)
class AAIWanderVolume : public AActor
{
public:
	class UAIWanderVolumeComponent*                    WanderVolume;                                             // 0x0318(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               DebugDrawVolume;                                          // 0x0320(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0321(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIWanderVolume");
		return ptr;
	}


	bool ContainsPoint(const struct FVector& Point);
};


// Class WKND.AIWanderVolumeComponent
// 0x0010 (0x02A0 - 0x0290)
class UAIWanderVolumeComponent : public USceneComponent
{
public:
	struct FVector                                     VolumeExtents;                                            // 0x0290(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x029C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIWanderVolumeComponent");
		return ptr;
	}

};


// Class WKND.AIWorldInteractionComponent
// 0x00D8 (0x01C8 - 0x00F0)
class UAIWorldInteractionComponent : public UActorComponent
{
public:
	float                                              IdealFollowDistance;                                      // 0x00F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FollowDistanceSlack;                                      // 0x00F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FollowRunDistance;                                        // 0x00F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinWanderRadius;                                          // 0x00FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxWanderRadius;                                          // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WanderCooldownDuration;                                   // 0x0104(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               WanderEnabled;                                            // 0x0108(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0109(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnNavigationComplete;                                     // 0x0110(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAlignComplete;                                          // 0x0120(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	class AActor*                                      pendingGrab;                                              // 0x0130(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnGrabSuccess;                                            // 0x0138(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnGrabFail;                                               // 0x0148(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorDropped;                                           // 0x0158(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorThrown;                                            // 0x0168(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	float                                              throwSpeed;                                               // 0x0178(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     throwDestination;                                         // 0x017C(0x000C) (Transient, IsPlainOldData)
	EAIThrowSelection                                  throwSelection;                                           // 0x0188(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0189(0x000F) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnHeldInHands;                                            // 0x0198(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCatchSuccess;                                           // 0x01A8(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCatchFail;                                              // 0x01B8(0x0010) (ZeroConstructor, Transient, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AIWorldInteractionComponent");
		return ptr;
	}


	void WanderBehaviourFinished();
	void TriggerThrow();
	void StopPlayingCatch();
	void StartPlayingCatch(class AActor* ball);
	void SetupThrow(const struct FVector& Point, float Speed, EAIThrowSelection throwOverride);
	void SetFollowTarget(class AActor* FollowTarget);
	void SearchForWanderTarget();
	bool IsPlayingCatch();
	void ClearFollowTarget();
};


// Class WKND.AnimNotify_EndTaunt
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_EndTaunt : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotify_EndTaunt");
		return ptr;
	}

};


// Class WKND.AnimNotify_EnableLookAt
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_EnableLookAt : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotify_EnableLookAt");
		return ptr;
	}

};


// Class WKND.AnimNotify_DisableLookAt
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_DisableLookAt : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotify_DisableLookAt");
		return ptr;
	}

};


// Class WKND.AnimNotify_EnableLookAtCustom
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_EnableLookAtCustom : public UAnimNotify
{
public:
	float                                              FadeInTime;                                               // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ELookAtFadeType>                       FadeInCurve;                                              // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotify_EnableLookAtCustom");
		return ptr;
	}

};


// Class WKND.AnimNotify_DisableLookAtCustom
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_DisableLookAtCustom : public UAnimNotify
{
public:
	float                                              FadeOutTime;                                              // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ELookAtFadeType>                       FadeOutCurve;                                             // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotify_DisableLookAtCustom");
		return ptr;
	}

};


// Class WKND.AnimNotifyState_CanParry
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_CanParry : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotifyState_CanParry");
		return ptr;
	}

};


// Class WKND.AnimNotifyState_CriticalDamage
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_CriticalDamage : public UAnimNotifyState
{
public:
	int                                                DamageMultiplier;                                         // 0x0030(0x0004) (Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotifyState_CriticalDamage");
		return ptr;
	}

};


// Class WKND.AnimNotifyState_Invulnerable
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_Invulnerable : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotifyState_Invulnerable");
		return ptr;
	}

};


// Class WKND.AnimNotifyState_MultiplyAttackSpeed
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_MultiplyAttackSpeed : public UAnimNotifyState
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimNotifyState_MultiplyAttackSpeed");
		return ptr;
	}

};


// Class WKND.AnimUtils
// 0x0000 (0x0028 - 0x0028)
class UAnimUtils : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AnimUtils");
		return ptr;
	}


	void STATIC_RemoveMetaDataOfClass(class UAnimationAsset* AnimationAsset, class UClass* MetaDataClass);
	void STATIC_RemoveMetaData(class UAnimationAsset* AnimationAsset, class UAnimMetaData* MetaDataObject);
	void STATIC_RemoveAllMetaData(class UAnimationAsset* AnimationAsset);
	void STATIC_GetMetaDataOfClass(class UAnimationAsset* AnimationAsset, class UClass* MetaDataClass, TArray<class UAnimMetaData*> MetaDataOfClass);
	void STATIC_GetMetaData(class UAnimationAsset* AnimationAsset, TArray<class UAnimMetaData*> MetaData);
	bool STATIC_ContainsMetaDataOfClass(class UAnimationAsset* AnimationAsset, class UClass* MetaDataClass);
	void STATIC_AddMetaDataObject(class UAnimationAsset* AnimationAsset, class UAnimMetaData* MetaDataObject);
	void STATIC_AddMetaData(class UAnimationAsset* AnimationAsset, class UClass* MetaDataClass, class UAnimMetaData* MetaDataInstance);
};


// Class WKND.AutomatedPerformanceCaptureUserCommand
// 0x0000 (0x0028 - 0x0028)
class UAutomatedPerformanceCaptureUserCommand : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCaptureUserCommand");
		return ptr;
	}

};


// Class WKND.AutomatedPerformanceCaptureUserCommand_Wait
// 0x0008 (0x0030 - 0x0028)
class UAutomatedPerformanceCaptureUserCommand_Wait : public UAutomatedPerformanceCaptureUserCommand
{
public:
	float                                              Time;                                                     // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCaptureUserCommand_Wait");
		return ptr;
	}

};


// Class WKND.AutomatedPerformanceCaptureUserCommand_ExecuteConsoleCommand
// 0x0010 (0x0038 - 0x0028)
class UAutomatedPerformanceCaptureUserCommand_ExecuteConsoleCommand : public UAutomatedPerformanceCaptureUserCommand
{
public:
	struct FString                                     Command;                                                  // 0x0028(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCaptureUserCommand_ExecuteConsoleCommand");
		return ptr;
	}

};


// Class WKND.AutomatedPerformanceCaptureUserCommand_SetPlayerTransform
// 0x0030 (0x0058 - 0x0028)
class UAutomatedPerformanceCaptureUserCommand_SetPlayerTransform : public UAutomatedPerformanceCaptureUserCommand
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty WKND.AutomatedPerformanceCaptureUserCommand_SetPlayerTransform.ActorProvidingTransform
	bool                                               bApplyPlayerHeightToCamera;                               // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bOnlyRotation;                                            // 0x0051(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0052(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCaptureUserCommand_SetPlayerTransform");
		return ptr;
	}

};


// Class WKND.AutomatedPerformanceCapture
// 0x0070 (0x0388 - 0x0318)
class AAutomatedPerformanceCapture : public AActor
{
public:
	float                                              DelayAfterTeleport;                                       // 0x0318(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DelayAfterStableStreamingLevels;                          // 0x031C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DesiredStatStabilityTime;                                 // 0x0320(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StatStabilityTimeout;                                     // 0x0324(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TimeCapturingUnrealStats;                                 // 0x0328(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x032C(0x0004) MISSED OFFSET
	TArray<struct FAutomatedPerformanceCaptureLocation> Locations;                                                // 0x0330(0x0010) (Edit, ZeroConstructor)
	class UAutomatedPerformanceCaptureAnchor*          Anchor;                                                   // 0x0340(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x40];                                      // 0x0348(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCapture");
		return ptr;
	}

};


// Class WKND.AutomatedPerformanceCaptureAnchor
// 0x0060 (0x0088 - 0x0028)
class UAutomatedPerformanceCaptureAnchor : public UObject
{
public:
	TArray<class UWKNDProgressionCheckpointData*>      TemporaryCheckpoints;                                     // 0x0028(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0038(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.AutomatedPerformanceCaptureAnchor");
		return ptr;
	}

};


// Class WKND.BaseMenuActor
// 0x0070 (0x0388 - 0x0318)
class ABaseMenuActor : public AActor
{
public:
	class UFrontendInteractionComponent*               InteractionComponent;                                     // 0x0318(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               bIsHandInteractable;                                      // 0x0320(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsHandHoverable;                                         // 0x0321(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0322(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnMenuSetActive;                                          // 0x0328(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMenuSetInactive;                                        // 0x0338(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x40];                                      // 0x0348(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BaseMenuActor");
		return ptr;
	}


	void SetInactive();
	void SetActiveSubMenu(class ASubMenuActor* Submenu);
	void SetActive();
	void ReceiveNewMenuComponentHovered(class UMenuBaseComponent* HoveredComponent);
	void ReceiveMenuDeactivated();
	void ReceiveMenuActivated();
	void PlayTabChangedSound(class UMenuTabComponent* MenuTabComponent);
	void PlayScrollContainerChangedSound(class UMenuScrollContainerComponent* MenuScrollContainerComponent, bool bIssuedFromConsole);
	void PlayRadiobuttonChangedSound(class UMenuRadioButtonComponent* MenuRadioButtonComponent);
	void PlayButtonSoundAtLocation(const struct FVector& ButtonLocation, EMenuButtonState ButtonState, bool bIsBackButton, bool bIsConsoleButton);
	void PlayButtonSound(class UMenuButtonComponent* MenuButtonComponent, bool bIsBackButton, bool bIsConsoleButton);
	void OnActorInteractReleased();
	void OnActorInteractPressed(class UFrontendInteractionController* Controller);
	void OnActorHoverEnd(bool bInteractionKeyPressed);
	void OnActorHoverBegin(class UFrontendInteractionController* Controller);
	class ASubMenuActor* GetActiveSubmenu();
	void AddSubMenu(class ASubMenuActor* Submenu, class ABaseMenuActor* ParentMenu);
};


// Class WKND.BlackoutWidget
// 0x0018 (0x0220 - 0x0208)
class UBlackoutWidget : public UUserWidget
{
public:
	bool                                               bShowAngleIndicatorImage;                                 // 0x0208(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0209(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnFadeOutFinished;                                        // 0x0210(0x0010) (ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BlackoutWidget");
		return ptr;
	}


	void SetIndicatorOpacity(float Opacity);
	void SetAngleIndicatorRotation(float Angle);
	void Init();
	void FadeOutWarningText();
	void FadeOutAngleIndicatorImage();
	void FadeInWarningText();
	void FadeInAngleIndicatorImage();
};


// Class WKND.BodyComponent
// 0x0060 (0x02F0 - 0x0290)
class UBodyComponent : public USceneComponent
{
public:
	class UCameraComponent*                            CameraComponent;                                          // 0x0290(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class AWKNDPlayerPawn*                             PlayerPawn;                                               // 0x0298(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bInitialised;                                             // 0x02A0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bInLocomotion;                                            // 0x02A1(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x02A2(0x0002) MISSED OFFSET
	float                                              InitialisationDelay;                                      // 0x02A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InitialisationTimeLeft;                                   // 0x02A8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxYawDifference;                                         // 0x02AC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotInterpSpeed;                                           // 0x02B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MidCameraPitch;                                           // 0x02B4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MidYawMultiplier;                                         // 0x02B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FullCameraPitch;                                          // 0x02BC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FullYawMultiplier;                                        // 0x02C0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxPitchDifference;                                       // 0x02C4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxForwardOffset;                                         // 0x02C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxHeightOffset;                                          // 0x02CC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FQuat                                       WorldQuat;                                                // 0x02D0(0x0010) (IsPlainOldData)
	struct FVector                                     DefaultRelativeLocation;                                  // 0x02E0(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BodyComponent");
		return ptr;
	}


	void StartLocomotion(TEnumAsByte<ENTSnapDirection> Direction);
	void EndLocomotion();
};


// Class WKND.BTDecorator_HasToken
// 0x0008 (0x0070 - 0x0068)
class UBTDecorator_HasToken : public UBTDecorator
{
public:
	struct FName                                       TokenName;                                                // 0x0068(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BTDecorator_HasToken");
		return ptr;
	}

};


// Class WKND.BTTask_ThrowAndCatch
// 0x01A0 (0x0210 - 0x0070)
class UBTTask_ThrowAndCatch : public UBTTaskNode
{
public:
	class AActor*                                      ballActor;                                                // 0x0070(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0078(0x0008) MISSED OFFSET
	class AAIController*                               owningAIController;                                       // 0x0080(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      playerActor;                                              // 0x0088(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               oneHandedAnimations;                                      // 0x0090(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x0091(0x000F) MISSED OFFSET
	bool                                               finishOnceHeld;                                           // 0x00A0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7F];                                      // 0x00A1(0x007F) MISSED OFFSET
	class UWKNDGrabberComponent*                       grabber;                                                  // 0x0120(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData03[0xE8];                                      // 0x0128(0x00E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BTTask_ThrowAndCatch");
		return ptr;
	}

};


// Class WKND.RICEAIController
// 0x0000 (0x0410 - 0x0410)
class ARICEAIController : public AAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.RICEAIController");
		return ptr;
	}


	class ARICEAICoordinator* GetAICoordinator();
};


// Class WKND.BuddyAIController
// 0x0000 (0x0410 - 0x0410)
class ABuddyAIController : public ARICEAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyAIController");
		return ptr;
	}

};


// Class WKND.BuddyAIPawn
// 0x00C8 (0x0440 - 0x0378)
class ABuddyAIPawn : public APawn
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0378(0x0010) MISSED OFFSET
	class UCapsuleComponent*                           Collision;                                                // 0x0388(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      SkeletalMesh;                                             // 0x0390(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAIInstructionComponent*                     Instructions;                                             // 0x0398(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UWKNDFloatingMovementComponent*              Movement;                                                 // 0x03A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	float                                              IdealFollowDistance;                                      // 0x03A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FollowDistanceSlack;                                      // 0x03AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FollowRunDistance;                                        // 0x03B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugFollowBehaviour;                                     // 0x03B4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x03B5(0x0003) MISSED OFFSET
	float                                              MinWanderRadius;                                          // 0x03B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxWanderRadius;                                          // 0x03BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WanderCooldownDuration;                                   // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               WanderEnabled;                                            // 0x03C4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugWanderBehaviour;                                     // 0x03C5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x03C6(0x0002) MISSED OFFSET
	float                                              POIRadius;                                                // 0x03C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               POIRequiresLOS;                                           // 0x03CC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               POIInteractionsEnabled;                                   // 0x03CD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EIdleBehaviourSelectionPolicy                      IdleBehaviourSelectionPolicy;                             // 0x03CE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x03CF(0x0001) MISSED OFFSET
	float                                              IdleCooldownDuration;                                     // 0x03D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DefaultIdleAnimCooldownDuration;                          // 0x03D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FBuddyIdleAnim>                      IdleAnims;                                                // 0x03D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               IdlesEnabled;                                             // 0x03E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugIdleBehaviour;                                       // 0x03E9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x6];                                       // 0x03EA(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnHeldInHands;                                            // 0x03F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCatchSuccess;                                           // 0x0400(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCatchFail;                                              // 0x0410(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               ShowThrowCatchDebug;                                      // 0x0420(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0421(0x0003) MISSED OFFSET
	float                                              catchDistOffset;                                          // 0x0424(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              throwOrCarryThresholdRange;                               // 0x0428(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              carryApproachDistance;                                    // 0x042C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              holdBallTime;                                             // 0x0430(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              maximumMoveRangeForCatch;                                 // 0x0434(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x8];                                       // 0x0438(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyAIPawn");
		return ptr;
	}


	void WanderBehaviourFinished();
	ETriggeredInteractionResult TriggerInteraction(class UBuddyInteractableComponent* Interactable);
	void StopPlayingThrowAndCatch();
	void StartPlayingThrowAndCatch(class AActor* ball, bool fetchOnly);
	void SetupIdleBehaviour();
	void SetSignal(const struct FName& SignalName);
	void SetFollowTarget(class AActor* FollowTarget);
	void SearchForWanderTarget();
	void SearchForPointOfInterest();
	void OnThrowCatchComplete();
	void OnPickupTakenFromMe();
	void OnPickupReleased();
	void OnPickupGrabSuccess();
	void OnPickupGrabFailed();
	void ForgetAllSignals();
	void ClearSignal(const struct FName& SignalName);
	void ClearFollowTarget();
	void AnimProxy_ObjectThrow(bool oneHand, float throwDistance);
	void AnimProxy_ObjectPickup(bool oneHand, float Height);
	void AnimProxy_ObjectLetGo();
	void AnimProxy_ObjectHandOver(bool oneHand);
	void AnimProxy_ObjectCatchSuccess(bool oneHand, float catchAngle);
	void AnimProxy_ObjectCatchReady(bool oneHand, float catchAngle);
	void AnimProxy_ObjectCatchFail(bool oneHand);
};


// Class WKND.BuddyAIPawnMovement
// 0x0030 (0x01A8 - 0x0178)
class UBuddyAIPawnMovement : public UPawnMovementComponent
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0178(0x001C) MISSED OFFSET
	float                                              WalkSpeed;                                                // 0x0194(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RunSpeed;                                                 // 0x0198(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurningSpeed;                                             // 0x019C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxAcceleration;                                          // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyAIPawnMovement");
		return ptr;
	}


	void PushMovementType(EBuddyAIMovementType MovementType);
	void PopMovementType();
};


// Class WKND.BuddyFloatingMovementComponent
// 0x0038 (0x01C8 - 0x0190)
class UBuddyFloatingMovementComponent : public UFloatingPawnMovement
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0190(0x0008) MISSED OFFSET
	float                                              WalkSpeed;                                                // 0x0198(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              WalkAcceleration;                                         // 0x019C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RunSpeed;                                                 // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RunAcceleration;                                          // 0x01A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SprintSpeed;                                              // 0x01A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SprintAcceleration;                                       // 0x01AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurningSpeed;                                             // 0x01B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x14];                                      // 0x01B4(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyFloatingMovementComponent");
		return ptr;
	}


	void PushMovementType(EBuddyAIMovementType MovementType);
	void PopMovementType();
};


// Class WKND.BuddyInteractableComponent
// 0x0030 (0x02C0 - 0x0290)
class UBuddyInteractableComponent : public USceneComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0290(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    SetupInteraction;                                         // 0x0298(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EBuddyInteractableType                             InteractableType;                                         // 0x02A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               AcceptsMultipleInteractions;                              // 0x02A9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x02AA(0x0002) MISSED OFFSET
	float                                              InteractionCooldownTime;                                  // 0x02AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EInteractableUsedPoint                             UsedPoint;                                                // 0x02B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               InteractionEnabled;                                       // 0x02B1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DebugInteractability;                                     // 0x02B2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xD];                                       // 0x02B3(0x000D) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyInteractableComponent");
		return ptr;
	}


	ETriggeredInteractionResult TriggeredByPlayer(class APawn* BuddyPawn);
	void StartInteraction(class UAIInstructionComponent* InstructionComponent);
	bool CanStartInteraction(EBuddyInteractableType Type);
};


// Class WKND.BuddyMovementInterface
// 0x0000 (0x0028 - 0x0028)
class UBuddyMovementInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyMovementInterface");
		return ptr;
	}

};


// Class WKND.BuddyTriggerGrab
// 0x0000 (0x0038 - 0x0038)
class UBuddyTriggerGrab : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyTriggerGrab");
		return ptr;
	}

};


// Class WKND.BuddyTriggerThrow
// 0x0000 (0x0038 - 0x0038)
class UBuddyTriggerThrow : public UAnimNotify
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.BuddyTriggerThrow");
		return ptr;
	}

};


// Class WKND.PhysicsInteraction
// 0x01B8 (0x01E0 - 0x0028)
class UPhysicsInteraction : public UObject
{
public:
	struct FName                                       InteractionName;                                          // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bEnabled;                                                 // 0x0030(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDebug;                                                   // 0x0031(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0032(0x0006) MISSED OFFSET
	struct FString                                     ShapeComponentName;                                       // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              Min;                                                      // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Max;                                                      // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Step;                                                     // 0x0050(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PressedEventThreshold;                                    // 0x0054(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              VelocityEventThreshold;                                   // 0x0058(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpringBackSpeed;                                          // 0x005C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ECollisionChannel>                     CollisionChannel;                                         // 0x0060(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0061(0x0007) MISSED OFFSET
	struct FString                                     SkinnedMeshComponentName;                                 // 0x0068(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	struct FName                                       SocketName;                                               // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FSoftObjectPath                             InteractionStartHaptics;                                  // 0x0080(0x0018) (Edit, Config)
	struct FSoftObjectPath                             InteractionCompletedHaptics;                              // 0x0098(0x0018) (Edit, Config)
	struct FSoftObjectPath                             InteractionOngoingHaptics;                                // 0x00B0(0x0018) (Edit, Config)
	TArray<class UPrimitiveComponent*>                 DetectOnlyComponents;                                     // 0x00C8(0x0010) (BlueprintVisible, ExportObject, ZeroConstructor)
	class USkinnedMeshComponent*                       SkinnedMeshComponent;                                     // 0x00D8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UShapeComponent*                             FoundShapeComponent;                                      // 0x00E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0xF8];                                      // 0x00E8(0x00F8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WKND.PhysicsInteraction");
		return ptr;
	}


	void UnlockInteraction();
	void SetEnabled(bool bInEnabled);
	void LockInteraction(float InLockTime, float InLockSpeedOverride);
	struct FName GetInteractionName();
	bool GetEnabled();
