#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass BP_ChapterWidgetMenu.BP_ChapterWidgetMenu_C
// 0x01C0 (0x0630 - 0x0470)
class ABP_ChapterWidgetMenu_C : public AChapterSelectMenu
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0470(0x0008) (Transient, DuplicateTransient)
	class UChapterSelectMenuItem*                      Credits;                                                  // 0x0478(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter04;                                             // 0x0480(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter11;                                             // 0x0488(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter10;                                             // 0x0490(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter09;                                             // 0x0498(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter08;                                             // 0x04A0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter07;                                             // 0x04A8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter06;                                             // 0x04B0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter05;                                             // 0x04B8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter04;                                             // 0x04C0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter03;                                             // 0x04C8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter02;                                             // 0x04D0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP3Chapter01;                                             // 0x04D8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter11;                                             // 0x04E0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter10;                                             // 0x04E8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter09;                                             // 0x04F0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter08;                                             // 0x04F8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter07;                                             // 0x0500(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter06;                                             // 0x0508(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter05;                                             // 0x0510(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter04;                                             // 0x0518(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter03;                                             // 0x0520(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter02;                                             // 0x0528(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP2Chapter01;                                             // 0x0530(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuScrollContainerComponent*               EP3ScrollContainer;                                       // 0x0538(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuScrollContainerComponent*               EP2ScrollContainer;                                       // 0x0540(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuButtonComponent*                        No;                                                       // 0x0548(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuButtonComponent*                        Yes;                                                      // 0x0550(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuBaseComponent*                          ConfirmPrompt;                                            // 0x0558(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UMenuButtonComponent*                        ChangeEpisodeButton;                                      // 0x0560(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter11;                                             // 0x0568(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter10;                                             // 0x0570(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter09;                                             // 0x0578(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter08;                                             // 0x0580(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter07;                                             // 0x0588(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter06;                                             // 0x0590(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter05;                                             // 0x0598(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter03;                                             // 0x05A0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter02;                                             // 0x05A8(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      EP1Chapter01;                                             // 0x05B0(0x0008) (BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UChapterSelectMenuItem*                      OldSelectedItem;                                          // 0x05B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	class UMenu_C*                                     MenuWidget;                                               // 0x05C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	TArray<struct FText>                               CheckpointNamesEp1;                                       // 0x05C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)
	TArray<struct FText>                               CheckpointNamesEp2;                                       // 0x05D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)
	TArray<struct FText>                               CheckpointNamesEp3;                                       // 0x05E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)
	TArray<class UChapterSelectMenuItem*>              EP1ChapterCheckpoints;                                    // 0x05F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UChapterSelectMenuItem*>              EP2ChapterCheckpoints;                                    // 0x0608(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UChapterSelectMenuItem*>              EP3ChapterCheckpoints;                                    // 0x0618(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UChapterSelectMenuItem*                      SelectedChapterItem;                                      // 0x0628(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BlueprintGeneratedClass BP_ChapterWidgetMenu.BP_ChapterWidgetMenu_C");
		return ptr;
	}


	void OnChapterChanged(class UMenuScrollContainerComponent* ChangedContainerComponent, bool bIssuedFromConsole);
	void ScrollDown(class UMenuScrollContainerComponent* ScrollContainer);
	void ScrollUp(class UMenuScrollContainerComponent* ScrollContainer);
	void UpdateCheckpointDisplayText();
	void GetWidgetFromConsole(class UMenu_C** OutWidget);
	void SetConsoleButtonConfig(int ButtonConfigID);
	void UserConstructionScript();
	void BndEvt__ChangeEpisodeButton_K2Node_ComponentBoundEvent_3_MenuButtonPressDelegate__DelegateSignature(const struct FPressedButtonComponent& PressedButtonComponent);
	void ReceiveMenuActivated();
	void BndEvt__EpisodesTab_K2Node_ComponentBoundEvent_0_MenuComponentValueChangedDelegate__DelegateSignature(const struct FChangedMenuComponent& ChangedMenuComponent);
	void Button1_Press();
	void Button2_Press();
	void Button3_Press();
	void Button4_Press();
	void BackButton_Press();
	void UpButton_Press();
	void DownButton_Press();
	void ShowConfirmPrompt();
	void CloseConfirmPrompt();
	void LoadChapter();
	void BndEvt__Yes_K2Node_ComponentBoundEvent_0_MenuButtonPressDelegate__DelegateSignature(const struct FPressedButtonComponent& PressedButtonComponent);
	void BndEvt__No_K2Node_ComponentBoundEvent_1_MenuButtonPressDelegate__DelegateSignature(const struct FPressedButtonComponent& PressedButtonComponent);
	void BndEvt__PlayChapterButton_K2Node_ComponentBoundEvent_0_MenuButtonPressDelegate__DelegateSignature(const struct FPressedButtonComponent& PressedButtonComponent);
	void BndEvt__EP1ScrollContainer_K2Node_ComponentBoundEvent_0_MenuComponentValueChangedDelegate__DelegateSignature(const struct FChangedMenuComponent& ChangedMenuComponent);
	void BndEvt__EP2ScrollContainer_K2Node_ComponentBoundEvent_0_MenuComponentValueChangedDelegate__DelegateSignature(const struct FChangedMenuComponent& ChangedMenuComponent);
	void BndEvt__EP3ScrollContainer_K2Node_ComponentBoundEvent_1_MenuComponentValueChangedDelegate__DelegateSignature(const struct FChangedMenuComponent& ChangedMenuComponent);
	void ReceiveBeginPlay();
	void UpButton_Release();
	void DownButton_Release();
	void ExecuteUbergraph_BP_ChapterWidgetMenu(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
