#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct AwareBlend.AwareBlend
// 0x0024
struct FAwareBlend
{
	float                                              Grip_2_863D8DDA4E48E7C9150F74877C3A329B;                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              A_4_3472705741E0838B1F819FB6976BF095;                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              B_6_BE4D41DA4893A634271E8E891C2A5034;                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AB_8_17AEFC684039D9E2FC710CBCDB1F0382;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       TypeA_12_3E3BED074803278512A73D84AA4273E4;                // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       TypeB_14_4F3F89344032AAA96B9B82AABAF30A28;                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Alpha_PropA_Through_17_2F2E83DF491C81E64CDA1CBF9C675744;  // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
