#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct HolodroneUIColors.HolodroneUIColors
// 0x0050
struct FHolodroneUIColors
{
	struct FLinearColor                                PrimaryColor_6_8E879453416242C587B250AB3C827C39;          // 0x0000(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FLinearColor                                PrimaryAccentColor_14_A5BBAC7148EEC925D7455A92E088B087;   // 0x0010(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FLinearColor                                SecondaryColor_8_D70F58514A204FBD9FBF8299658403F6;        // 0x0020(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FLinearColor                                TertiaryColor_10_54F2319A46628C5FA41F349954C13707;        // 0x0030(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	struct FLinearColor                                BackgroundColor_5_59A530184BB8DE1C21BED48FF5F6B6E3;       // 0x0040(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
