#pragma once

// VaderImmortal_1 (236956) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_ZoeyDroid_AnimBlueprint.BP_ZoeyDroid_AnimBlueprint_C
// 0x3F28 (0x42E8 - 0x03C0)
class UBP_ZoeyDroid_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03C0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_AF8D0239478B8DE499970CB7719D5A65;      // 0x03C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A6CD87E40705E5E192B0587A8156BDE;// 0x0410(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA588BEE4EB6F5DD76597E9D494B659D;// 0x0490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C95A0CF48D150DF5AC917B0C66142DA;// 0x0510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10668CCB401625B8A5DE489D2FE7526B;// 0x0590(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DD5C092433DE3096B4431A2D788F629;// 0x0610(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C508A034C6A686235DF37BA2DCAB427;// 0x0690(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_313AE70A49ADDB84B1A78495DEA4BA97;// 0x0710(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA328E2C44084B13D537768B5691650C;// 0x0790(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E784E6CE4C4AA45869218A8C94261AB6;// 0x0810(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C927A9C24D98CD96035A2A865869C251;// 0x0890(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E93650B54917D38EA2113994C9EDB275;// 0x0910(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C019250740A90BAA3F012BA99BF85B49;// 0x0990(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BDA95D814429525DDE7188BAFC6B6A45;// 0x0A10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B86A7F7F49813C8D637E669C1983609C;// 0x0A90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22DCC797493C567069AC44A10C7E11EC;// 0x0B10(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F736130E4266505515B8FF9D21DDD128;// 0x0B90(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_94ADA6BE42AE3A638ECF2F9C5BB691AE;// 0x0C00(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F16F8B4447A2C4F633ED0AA6063B9F6B;// 0x0D28(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C4ED3240499F0ECADC3D3C99D23AA34E;// 0x0E08(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_86AC08FE41DE9A1B2DDCF79A4A2F3E48;// 0x0E50(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_52B9C40541F25EECEE4FEA9A81E8C822;// 0x0EC0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_322653104DAC2FE58F4547A24E0127A8;// 0x0F30(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5F5634454E4BC03E26A91F8A73AA0772;// 0x1010(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DD5D94DD40A3C6F875E89691C6E1F19E;// 0x1058(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D1C4C98D4304E2A6A870569242E28365;// 0x10C8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_ADEE2FE84643A54434AA8DAC973BACAA;// 0x1138(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AF96F12440B26FFF1BB4B49DAF53735D;// 0x1218(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CF28D00E4681625AEF2ECC8266FB205A;// 0x1260(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E1369CB44CEAF64B62B839900C9B5840;// 0x1388(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C0775954ADF60EDAAA4BC923278FEBA;// 0x13D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_74EC34664128BDB016B8FC848A8BC965;// 0x1440(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C2C10073483F2E3CC7D654A50E558D4A;// 0x14B0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9CAAE63D4B6B1DDA894E248057730FEE;// 0x1590(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EFF34664A83E979ED66ED922ED77F3B;// 0x15D8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF298A7B49EA627B34C947B4BB12ABEE;// 0x1648(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1EEDF5C64AE9B18771F4F99DEFD3CDA1;// 0x16B8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_09744A7F411510773CFDF29B1649F023;// 0x1728(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2C28939641E91CF18C2741B9B35CD2C9;// 0x1798(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_915467A048677C2FA7F34A97292E8E64;// 0x1878(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FD80752A4F43A3C1A8FEA8916BCED377;// 0x1948(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D44313C64549C3A7D24A7592345D86F5;// 0x1A28(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2A5D20049BBEB0B1299F3A690249C0F;// 0x1A70(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A021292D4A642D4430FFE399916BC187;// 0x1AE0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_DAF79C9E41C14D3FCA254DBD5107DF6A;// 0x1B50(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_66555D95425C70F0603F1DB8A474B420;// 0x1C30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F652CD244D53544200E439807DB2B62;// 0x1C78(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_913E2E9543561DFA52B473811C7601E4;// 0x1CE8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_751E1394467C0C08667636AA8D6BC385;// 0x1E10(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D4C5E09A4CFAA151C166C5B49A8F5456;// 0x1EF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A299E54240710EDB57CA1F87E5350943;// 0x1F38(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F49F433E44E199E5AE51E19123E8C441;// 0x1FA8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7D5389F94722F55ABD22BEB87A03ECA5;// 0x20D0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_90F6265B40A151461065CE8AE355C4D6;// 0x21B0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC29023446473368F2407388D6DA86B5;// 0x21F8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0851034E4A62FC686EBF178210CA08F9;// 0x2268(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FC683FF744AADBA7E57FD2AFB31703A2;// 0x22D8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_41DD09AF4D538F8434F08581D2E8BD1F;// 0x23B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0429BDB242B484416E922BB110428294;// 0x2400(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73052D354EBE8E999477DDB7C671AA07;// 0x2470(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1FBA6140439C04D357F0618B996D11E7;// 0x24E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9658EF1741AC36EA9AF597B69C46B875;// 0x2550(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_F746B6214C8CB9D82619559B2814D88F;// 0x25C0(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_DAC16DC646B5337393DB92B71D269734;// 0x2638(0x0078)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_56840B1347D5D707F6BE90AD5AAA5617;// 0x26B0(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8C21CFBC4DB648332495CDA42422FEF5;// 0x2790(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_18E284FE433D5DDE514169A9936C4F96;// 0x27D8(0x00D8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DC687041461CD75A717AB7A9B86D1E97;// 0x28B0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D133B5C64456A140BA74D697954EB30A;// 0x2980(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_841E8D0943605CB4F5D35EB4FD0106B9;// 0x29F0(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EC0B790B444C72A6BE34E6AB744E98BA;// 0x2A68(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5EDA18B1451BD50EC0541DBA59F44B7C;// 0x2B90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F3209DCF497E3CB0C7D581A71F609EAC;// 0x2BD8(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_91B607DA449F81C6F620439A451F1060;// 0x2CB0(0x00A8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_383AC97E458106D0782ADF9F0DB8E924;// 0x2D58(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DD14B88E490E559B5256DCA16C268D31;// 0x2DD0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_294B543C45562CD88A439AB88AC7DDD5;// 0x2E20(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8B94E4DB45FF9AA109528E962E8A34D0;      // 0x2E70(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_55E3CFF0446F1FE15A0689AAAAEFA8AC;      // 0x2ED8(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1AC5318047D7A61014EFCAB7EFA96E3B;      // 0x2F40(0x0068)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E5A22D764A557B9042142A90EFDA4DD8;// 0x2FA8(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7734F80E49627546023B88A569391E34;// 0x3060(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_EDE8ADD64A6393267A82FCADEAAC4107;// 0x30A8(0x0048)
	class UBlendSpaceBase*                             __SUBINSTANCE_AO_LookAt_DistanceBodyAdjustment_D1FF7F844A249ABAD43A6292F71E67A1;// 0x30F0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   __SUBINSTANCE_BlinkTimeRandomLimits_D1FF7F844A249ABAD43A6292F71E67A1;// 0x30F8(0x0008) (IsPlainOldData)
	float                                              __SUBINSTANCE_BlinkMovementSensitivity_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3100(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               __SUBINSTANCE_UseProceduralBlink_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3104(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x3105(0x0003) MISSED OFFSET
	struct FName                                       __SUBINSTANCE_HeadPivotSocketName_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3108(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               __SUBINSTANCE_UseTargetSpeedBlink_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3110(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x3111(0x0003) MISSED OFFSET
	float                                              __SUBINSTANCE_BlinkMovementSpeedScale_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3114(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              __SUBINSTANCE_BlinkTimerSpeedScale_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3118(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x311C(0x0004) MISSED OFFSET
	struct FName                                       __SUBINSTANCE_HeadSocketName_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3120(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlendSpaceBase*                             __SUBINSTANCE_AO_LookAt_Distance_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3128(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAnimSequenceBase*                           __SUBINSTANCE_AS_Blink__Additive__D1FF7F844A249ABAD43A6292F71E67A1;// 0x3130(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAnimSequenceBase*                           __SUBINSTANCE_AS_Blink_D1FF7F844A249ABAD43A6292F71E67A1;  // 0x3138(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlendSpaceBase*                             __SUBINSTANCE_AO_LookAt_Eyes_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3140(0x0008) (ZeroConstructor, IsPlainOldData)
	class UBlendSpaceBase*                             __SUBINSTANCE_AO_LookAt_Body_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3148(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FAnimNode_SubInstance                       AnimGraphNode_SubInstance_D1FF7F844A249ABAD43A6292F71E67A1;// 0x3150(0x00C8)
	unsigned char                                      UnknownData03[0x8];                                       // 0x3218(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_E6ED41E142D21CA68C1B59A1E8B7CF48; // 0x3220(0x01C0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8841B4DE43B9F4E4063475B57632A4D8;// 0x33E0(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5CB2D1284C17B2A501FDA08EFC3E0239;// 0x3488(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7330BFB04558B53AE8581CA9F772F355;// 0x3568(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_DDEA76624A95CDB917ED3EBAFE2C94CE;// 0x35B8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_327CEDF343E092E003194DB3CD95DF74;// 0x3600(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_48AA965D4BFE327D8E93C0AD6E490BDB;// 0x3648(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_90A13E7047D59FB75319F9BAADE0EC95;// 0x36F0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8D9FF9BE4C2A7D2D974DAC91D75F0CC6;// 0x3740(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_739AA3B34E67235D0AB76B875F7C180D;// 0x3790(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_889C1F7C4EBBD25BAB6E62BB75E8CFB4;// 0x3838(0x0050)
	struct FAnimNode_SpringBone                        AnimGraphNode_SpringBone_CB4641EA4241C784CABEEB915D275FDC;// 0x3888(0x00D8)
	struct FAnimNode_SpringBone                        AnimGraphNode_SpringBone_60F9C19F465656311BE67B8EFB13BD28;// 0x3960(0x00D8)
	struct FAnimNode_SpringBone                        AnimGraphNode_SpringBone_6A0A633D4724682CBACE3994A799D977;// 0x3A38(0x00D8)
	struct FAnimNode_SpringBone                        AnimGraphNode_SpringBone_6FF40C214BE67AB02B5EA7AC6C2EDFE7;// 0x3B10(0x00D8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_463DCA2B402DF699DF7B54A8C8876CEA;// 0x3BE8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C0D0782E42853569ECA47DA6F5E44EED;// 0x3C30(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7FDFB12F4585CB2F8EDD6C9CCF912C78;// 0x3C78(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EA81394141F38E18A5ED0EB43CE28E48;// 0x3D30(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1F2AA7174C40A1D6DFF9B29927265EDA;// 0x3DE8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_264F515A4DD22D32E26CE6AAE66B494B;// 0x3E30(0x0048)
	struct FAnimationSaveBoneTransformNode             AnimationSaveBoneTransformGraphNode_16F22B5A4CD1C93642E2F99DBCE24110;// 0x3E78(0x0058)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8D20F4304128CEAA9512EC992F961766;// 0x3ED0(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2AC36B2F4B539A1AB353BC8D29F02D10;// 0x3F88(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_04DEF1404647BA539EB603BFBDA0A6B1;// 0x3FD0(0x0048)
	unsigned char                                      UnknownData04[0x8];                                       // 0x4018(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_1C25DD4841D7C609F427A9B5630CEE9B; // 0x4020(0x01C0)
	TEnumAsByte<EGrabbableObjectType>                  GrabObjectType;                                           // 0x41E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x41E1(0x0003) MISSED OFFSET
	float                                              ObjectCatchAngle;                                         // 0x41E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ObjectPickUpHeight;                                       // 0x41E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ObjectThrowDistance;                                      // 0x41EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInteractingWithObjects;                                 // 0x41F0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectPickUp;                                           // 0x41F1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectThrow;                                            // 0x41F2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectLetGo;                                            // 0x41F3(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectHandOver;                                         // 0x41F4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectTryToCatch;                                       // 0x41F5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectCatchFail;                                        // 0x41F6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               rqObjectCatchSuccess;                                     // 0x41F7(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RelativeVelocity;                                         // 0x41F8(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              FloatingHeightAdjuster;                                   // 0x4204(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FloatTime;                                                // 0x4208(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FloatWavelength;                                          // 0x420C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FloatMax;                                                 // 0x4210(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DeltaTimeX;                                               // 0x4214(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ThrowDistanceThreshold;                                   // 0x4218(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SequenceBlendInterp;                                      // 0x421C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBP_HoverController_C*                       HoverController;                                          // 0x4220(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	struct FVector                                     HoverOffset;                                              // 0x4228(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x4234(0x0004) MISSED OFFSET
	class UBlendSpaceBase*                             AO_LookAt_Body;                                           // 0x4238(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             AO_LookAt_Eyes;                                           // 0x4240(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           AS_Blink;                                                 // 0x4248(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequenceBase*                           AS_Blink__Additive_;                                      // 0x4250(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpaceBase*                             AO_LookAt_Distance;                                       // 0x4258(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       HeadSocketName;                                           // 0x4260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlinkTimerSpeedScale;                                     // 0x4268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlinkMovementSpeedScale;                                  // 0x426C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UseTargetSpeedBlink;                                      // 0x4270(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x4271(0x0007) MISSED OFFSET
	struct FName                                       HeadPivotSocketName;                                      // 0x4278(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UseProceduralBlink;                                       // 0x4280(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x3];                                       // 0x4281(0x0003) MISSED OFFSET
	float                                              BlinkMovementSensitivity;                                 // 0x4284(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector2D                                   BlinkTimeRandomLimits;                                    // 0x4288(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              HoverWeight;                                              // 0x4290(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     PelvisOffset;                                             // 0x4294(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	class UBP_LookAtController_C*                      LookController;                                           // 0x42A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	float                                              AdjustPelvisToPlayerHeight;                               // 0x42A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HoverResetNeeded___Just_Teleported_;                      // 0x42AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x42AD(0x0003) MISSED OFFSET
	struct FVector                                     LastPelvisOffset;                                         // 0x42B0(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
	float                                              AnimDynamicsWeight;                                       // 0x42BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AdjustPelvisToPlayerHeightWeight;                         // 0x42C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeadWires_AnimDynamicsWeight;                             // 0x42C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RHipWires_AnimDynamicsWeight;                             // 0x42C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CHipWires_AnimDynamicsWeight;                             // 0x42CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LHipWires_AnimDynamicsWeight;                             // 0x42D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AdditiveIdleNoiseWeight;                                  // 0x42D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CloselyThrownObject;                                      // 0x42D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ObjectDropped;                                            // 0x42D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x6];                                       // 0x42DA(0x0006) MISSED OFFSET
	class ABP_ZoeyCharacter_C*                         MyBlueprint;                                              // 0x42E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BP_ZoeyDroid_AnimBlueprint.BP_ZoeyDroid_AnimBlueprint_C");
		return ptr;
	}


	void SetThrownObjectVariables();
	void SetMovementVelocity();
	void FindHoverOffset();
	void SetIdleNoiseWeight();
	void SetAnimDynamicsWeights();
	void AdjustPelvisToMatchPlayerCurrentHeight();
	void ShouldTeleportHoverController_(float InputPin);
	void TeleportHoverControllerTrackingLocation();
	void FloatingBob(float Time, float Period, float Amplitude, float* Value);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_ZoeyDroid_AnimBlueprint_AnimGraphNode_TwoWayBlend_F746B6214C8CB9D82619559B2814D88F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_ZoeyDroid_AnimBlueprint_AnimGraphNode_TwoWayBlend_DAC16DC646B5337393DB92B71D269734();
